Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.StructuralWallUsage
The wall structural usage.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralWallUsage,System.Boolean)
Constructs a new instance of a filter to match walls that have the given structural wall usage,
with the option to match all walls which are not of the given structural wall usage.
structuralWallUsage:
The structural usage to match.
inverted:
True if the filter should match all walls which are not of the given structural wall usage.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralWallUsage)
Constructs a new instance of a filter to match walls that have the given structural wall usage.
structuralWallUsage:
The wall structural usage.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralWallUsageFilter
A filter used to match walls that have the given structural wall usage.
Remarks:
This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements
before the elements are obtained and expanded. Therefore this filter does not have to be
paired with another quick filter to minimize the number of Elements that are expanded.
Since:
2011